Revit 2027 API
RevitLinkGraphicsSettings.GetPhaseId Method
 The linked document phase id of RevitLinkGraphicsSettings, or InvalidElementId if there is no phase explicitly assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetPhaseId()
Public Function GetPhaseId As ElementId
public:
ElementId^ GetPhaseId()
member GetPhaseId : unit -> ElementId
Return Value
ElementId
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace